keda-servicebus-loadtest/azure-load-test/AzureServiceBus LoadTest-manual.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AzureServiceBus LoadTest">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="LoadTesting">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">100</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <jp.co.pnop.jmeter.protocol.azureservicebus.sampler.AzServiceBusSampler guiclass="jp.co.pnop.jmeter.protocol.azureservicebus.sampler.gui.AzServiceBusSamplerGui" testclass="jp.co.pnop.jmeter.protocol.azureservicebus.sampler.AzServiceBusSampler" testname="Azure Service Bus Sampler">
          <boolProp name="createTransaction">false</boolProp>
          <boolProp name="continueTransaction">true</boolProp>
          <boolProp name="commitTransaction">false</boolProp>
          <boolProp name="rollbackTransaction">false</boolProp>
          <elementProp name="messages" elementType="jp.co.pnop.jmeter.protocol.amqp.sampler.AzAmqpMessages" guiclass="jp.co.pnop.jmeter.protocol.azureservicebus.sampler.gui.AzServiceBusMessagesPanel" testclass="jp.co.pnop.jmeter.protocol.amqp.sampler.AzAmqpMessages" testname="[res_key=Azure Event Hubs Default]">
            <collectionProp name="Messages.messages">
              <elementProp name="Welcome to Azure Cloud Native!" elementType="jp.co.pnop.jmeter.protocol.amqp.sampler.AzAmqpMessage">
                <stringProp name="Message.messageType">String</stringProp>
                <stringProp name="Message.message">Welcome to Azure Cloud Native!</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="svcparams" elementType="jp.co.pnop.jmeter.protocol.azureservicebus.common.AzServiceBusClientParams" guiclass="jp.co.pnop.jmeter.protocol.azureservicebus.common.gui.AzServiceBusClientParamsPanel" testclass="jp.co.pnop.jmeter.protocol.azureservicebus.common.AzServiceBusClientParams">
            <stringProp name="connectionType">Create New Connection</stringProp>
            <stringProp name="namespaceName">keda-demo-azcloudative.servicebus.windows.net</stringProp>
            <stringProp name="authType">Shared access signature</stringProp>
            <stringProp name="sharedAccessKeyName">queuerule</stringProp>
            <stringProp name="sharedAccessKey">xxxx</stringProp>
            <stringProp name="destType">Queue</stringProp>
            <stringProp name="queueName">demo-queue</stringProp>
            <stringProp name="protocol">AMQP</stringProp>
          </elementProp>
        </jp.co.pnop.jmeter.protocol.azureservicebus.sampler.AzServiceBusSampler>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.isSuccessful() &amp;&amp; (prev.getResponseCode() == null || prev.getResponseCode() == &quot;&quot;)) {
    prev.setResponseCode(&quot;200&quot;);
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>