keda-servicebus-loadtest/azure-load-test/AzureServiceBus LoadTest-parameters.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Azure Service Bus Load Test (parametrized)">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Service Bus Load">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments">
            <elementProp name="udv_SBNamespace" elementType="Argument">
              <stringProp name="Argument.name">udv_SBNamespace</stringProp>
              <stringProp name="Argument.value">${__BeanShell( System.getenv(&quot;SBNamespace&quot;) )}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="udv_SBQueueName" elementType="Argument">
              <stringProp name="Argument.name">udv_SBQueueName</stringProp>
              <stringProp name="Argument.value">${__BeanShell( System.getenv(&quot;SBQueueName&quot;) )}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="udv_SBQueueRule" elementType="Argument">
              <stringProp name="Argument.name">udv_SBQueueRule</stringProp>
              <stringProp name="Argument.value">${__BeanShell( System.getenv(&quot;SBQueueRule&quot;) )}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="udv_SBAccessKey" elementType="Argument">
              <stringProp name="Argument.name">udv_SBAccessKey</stringProp>
              <stringProp name="Argument.value">${__GetSecret(SBAccessKey)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <jp.co.pnop.jmeter.protocol.azureservicebus.sampler.AzServiceBusSampler guiclass="jp.co.pnop.jmeter.protocol.azureservicebus.sampler.gui.AzServiceBusSamplerGui" testclass="jp.co.pnop.jmeter.protocol.azureservicebus.sampler.AzServiceBusSampler" testname="Azure Service Bus Sampler">
          <boolProp name="createTransaction">false</boolProp>
          <boolProp name="continueTransaction">true</boolProp>
          <boolProp name="commitTransaction">false</boolProp>
          <boolProp name="rollbackTransaction">false</boolProp>
          <elementProp name="messages" elementType="jp.co.pnop.jmeter.protocol.amqp.sampler.AzAmqpMessages" guiclass="jp.co.pnop.jmeter.protocol.azureservicebus.sampler.gui.AzServiceBusMessagesPanel" testclass="jp.co.pnop.jmeter.protocol.amqp.sampler.AzAmqpMessages" testname="[res_key=Azure Event Hubs Default]">
            <collectionProp name="Messages.messages">
              <elementProp name="Welcome to Azure Cloud Native! It&apos;s ${__time(YMDHMS)}" elementType="jp.co.pnop.jmeter.protocol.amqp.sampler.AzAmqpMessage">
                <stringProp name="Message.messageType">String</stringProp>
                <stringProp name="Message.message">Welcome to Azure Cloud Native! It&apos;s ${__time(YMDHMS)}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="svcparams" elementType="jp.co.pnop.jmeter.protocol.azureservicebus.common.AzServiceBusClientParams" guiclass="jp.co.pnop.jmeter.protocol.azureservicebus.common.gui.AzServiceBusClientParamsPanel" testclass="jp.co.pnop.jmeter.protocol.azureservicebus.common.AzServiceBusClientParams">
            <stringProp name="connectionType">Create New Connection</stringProp>
            <stringProp name="namespaceName">${udv_SBNamespace}</stringProp>
            <stringProp name="authType">Shared access signature</stringProp>
            <stringProp name="sharedAccessKeyName">${udv_SBQueueRule}</stringProp>
            <stringProp name="sharedAccessKey">${__GetSecret(SBAccessKey)}</stringProp>
            <stringProp name="destType">Queue</stringProp>
            <stringProp name="queueName">${udv_SBQueueName}</stringProp>
            <stringProp name="protocol">AMQP</stringProp>
          </elementProp>
        </jp.co.pnop.jmeter.protocol.azureservicebus.sampler.AzServiceBusSampler>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.isSuccessful() &amp;&amp; (prev.getResponseCode() == null || prev.getResponseCode() == &quot;&quot;)) {
    prev.setResponseCode(&quot;200&quot;);
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>